Repository: maelgangloff/signed-invoice-verif
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr, it, ru, tr

source: Toggle flash
de: Blitz umschalten
es: Flash
fr: Flash
it: Flash
ru: Вспышка
tr: Flaş

source: Valid
de: Geprüfte Rechnung
es: Factura verificada
fr: Facture verifiée
it: Fattura verificata
ru: Подтвержденный счет
tr: Fatura doğrulandı

# aboutTheAppContent4
source: . Go there to contribute, donate, submit a feature request or a bug report. Any contributions are welcome.
de: veröffentlicht. Jeder Beitrag zur Verbesserung dieser App ist willkommen.
es: . Cualquier contribución para mejorar esta aplicación es bienvenida.
fr: . Toute contribution à l'amélioration de cette application est la bienvenue.
it: . Ogni contributo per migliorare questa applicazione è benvenuto.
ru: . Любой вклад в улучшение этого приложения приветствуется.
tr: . Bu uygulamayı geliştirmeye yönelik her türlü katkı memnuniyetle karşılanır.

source: Number of line
de: Anzahl der Zeilen
es: Número de líneas
fr: Nombre de lignes
it: Numero di linee
ru: Количество строк
tr: Satır sayısı

source: Due date
de: Fällig am
es: Fecha de vencimiento
fr: Échéance le
it: Data di scadenza
ru: Выполнить к
tr: Son Ödeme Tarihi

source: Disable verification
de: Verifizierung deaktivieren
es: Desactivar verificación
fr: Désactiver la vérification
it: Disattivare la verifica
ru: Отключить проверку
tr: Doğrulamayı devre dışı bırak

source: From
de: Von
es: De
fr: De
it: De
ru: Из
tr: Gönderen

source: Paid
de: Bezahlt
es: Pagado
fr: Payée
it: Pagata
ru: Оплаченный
tr: Ödenmiş

source: Load a public key
de: Öffentlichen Schlüssel importieren
es: Cargar una clave pública
fr: Importer une clé publique
it: Caricare una chiave pubblica
ru: Импортировать открытый ключ
tr: Ortak anahtarı içe aktar

# dateFormat
source: yyyy-MM-dd
de: dd.MM.yyyy
es: dd/MM/yyyy
it: dd/MM/yyyy
ru: дд/мм/гггг
tr: dd.mm.yyyy

source: More information
de: Mehr Informationen
es: Más información
fr: Plus d'information
it: Maggiori informazioni
ru: Больше информации
tr: Daha fazla bilgi

# unableScanWithoutPermission
source: Unable to scan without camera access permission
de: Ohne Kamerazugriff kann nicht gescannt werden
es: No se puede escanear sin acceso a la cámara
fr: Impossible de scanner sans accès à la caméra
it: Impossibile eseguire la scansione senza accesso alla fotocamera
ru: Невозможно сканировать без доступа к камере
tr: Kameraya erişim olmadan tarama yapılamıyor

source: Amount
de: Gesamtsumme
es: Importe total
fr: Montant
it: Importo
ru: Количество
tr: Fatura tutarı

source: Invalid public key
de: Ungültiger öffentlicher Schlüssel
es: Clave pública no válida
fr: Clé publique invalide
it: Chiave pubblica non valida
ru: Неверный открытый ключ
tr: Geçersiz ortak anahtar

source: Using the app
de: Verwenden
es: Uso de la aplicación
fr: Utilisation
it: Utilizzo
ru: Использовать
tr: Kullanmak

source: Information
de: Informationen
es: Información
it: Informazioni
ru: Информация
tr: Bilgi

source: Load a public key file
de: öffentliche Schlüsseldatei importieren
es: Cargar un archivo de clave pública
fr: Importer un fichier de clé publique
it: Caricare un file di chiave pubblica
ru: Импортировать файл открытого ключа
tr: Ortak anahtar dosyasını içe aktar

# aboutTheAppContent3
source: This app is open source and published on
de: Die App ist Open Source und ihr Code ist auf
es: La aplicación es de código abierto y su código está disponible en
fr: L'application est opensource et son code est publié sur
it: L'applicazione è open source e il suo codice è pubblicato su
ru: Приложение имеет открытый исходный код, его код опубликован на
tr: Uygulama açık kaynaklıdır ve kodu şu adreste yayınlanmaktadır:

# aboutTheAppContent1
source: This mobile application allows to verify invoices generated with
de: Mit dieser App können Sie die Echtheit von Rechnungen überprüfen, die mit dem
es: Esta aplicación móvil te permite verificar la autenticidad de las facturas generadas con la herramienta
fr: Cette application mobile vous permet de vérifier l'authenticité des factures générées avec l'outil
it: Questa applicazione mobile consente di verificare l'autenticità delle fatture generate con lo strumento
ru: Это мобильное приложение позволяет вам проверять подлинность счетов, созданных с помощью этого инструмента.
tr: Bu mobil uygulama,

# usingTheAppContent
source: By default the app does not verify the signatures. To verify a Digital Signature Stamp (DSS), import the public key by clicking on the key icon. You can toggle the flash with the button.
de: Standardmäßig überprüft die App keine Signaturen. Um einen digitalen Signaturstempel (DSS) zu überprüfen, importieren Sie den öffentlichen Schlüssel, indem Sie auf die schlüsselförmige Schaltfläche klicken. Sie können Blitz mit der Blitz-Schaltfläche aktivieren.
es: Por defecto, la aplicación no verifica las firmas. Para verificar un sello de firma digital (DSS), importa la clave pública haciendo clic en el botón en forma de llave. Puedes activar el flash con el botón.
fr: Par défaut, l'application ne vérifie pas les signatures. Pour vérifier un tampon de signature numérique (DSS), importez la clé publique en cliquant sur le bouton en forme de clé. Vous pouvez activer le flash avec le bouton flash.
it: Di default, l'applicazione non verifica le firme. Per verificare un timbro di firma digitale (DSS), importare la chiave pubblica facendo clic sul pulsante a forma di chiave. È possibile attivare il flash con il pulsante.
ru: По умолчанию приложение не проверяет подписи. Чтобы проверить штамп цифровой подписи (DSS), импортируйте открытый ключ, нажав кнопку ключа. Вспышку можно активировать кнопкой.
tr: Varsayılan olarak uygulama imzaları doğrulamaz. Dijital imza damgasını (DSS) doğrulamak için anahtar düğmesini tıklatarak genel anahtarı içe aktarın. Flaş butonunu kullanarak aktif hale getirebilirsiniz.

source: Invalid
de: Ungültige Rechnung
es: Factura no válida
fr: Facture invalide
it: Fattura non valida
ru: Неверный счет
tr: Geçersiz fatura

source: To
de: Zu
es: Para
fr: Pour
it: A
ru: Для
tr: Alıcı

# pleaseAllowFSAccessFile
source: Please allow file system access to open a key file.
de: Bitte erlauben Sie dem System, eine Schlüsseldatei zu importieren.
es: Por favor, permite al sistema acceder al archivo de clave.
it: Si prega di consentire l'accesso al file system per importare un file di chiave.
ru: Пожалуйста, разрешите системе импортировать файл ключа.
tr: Lütfen sistemin bir anahtar dosyasını içe aktarmasına izin verin.

source: Issue date
de: Ausgegeben am
es: Fecha de emisión
fr: Émise le
it: Data di emissione
ru: Выпущено
tr: Yayınlandığı tarih

# unexpectedErrorOccured
source: An unexpected error occured.
de: Ein unerwarteter Fehler ist aufgetreten.
es: Se produjo un error inesperado.
fr: une erreur inattendue est survenue.
it: Si è verificato un errore imprevisto.
ru: Произошла непредвиденная ошибка.
tr: Beklenmedik bir hata oluştu.

source: Status
es: Estado
fr: Statut
it: Stato
ru: Положение дел
tr: Durum

source: Unpaid
de: Unbezahlt
es: Impago
fr: Impayée
it: Non pagata
ru: Неоплачиваемый
tr: ödenmemiş

source: Unverified
de: Unbestätigte Rechnung
es: Factura no verificada
fr: Facture non verifiée
it: Fattura non verificata
ru: Неподтвержденный счет
tr: Doğrulanmamış fatura

source: Quantity
de: Menge
es: Cantidad
fr: Quantité
it: Numero di linee
ru: Количество
tr: Miktar

source: Invalid DSS
de: Ungültiger DSS
es: DSS no válido
fr: DSS invalide
it: DSS non valido
ru: Неверный DSS
tr: Geçersiz DSS

source: Permission denied
de: Erlaubnis verweigert
es: Permiso denegado
fr: Permission refusée
it: Permesso negato
ru: Доступ запрещен
tr: İzin reddedildi

source: Scan a Digital Signature Stamp
de: DSS-Puffer scannen
es: Escanear un sello de firma digital (DSS)
fr: Scanner un tampon DSS
it: Scansionare un timbro DSS
ru: Сканирование буфера DSS
tr: Bir DSS arabelleğini tarayın

source: Error
de: Fehler
fr: Erreur
it: Errore
ru: Ошибка
tr: Hata

# aboutTheAppContent2
source: tool.
de: -Tool erstellt wurden.
tr: aracıyla oluşturulan faturaların orijinalliğini doğrulamanıza olanak tanır.

# invalidDSSContent
source: Couldn't decode DSS, QR code does not contain a valid JWT token. This happens sometimes when the qr code isn't read properly. In that case you should try again.
de: Der DSS kann nicht dekodiert werden, der QR-Code enthält kein gültiges JWT-Token. Versuch es noch einmal.
es: No se puede decodificar el DSS, el código QR no contiene un token JWT válido. Por favor, inténtalo de nuevo.
fr: Impossible de décoder le DSS, le QR code ne contient pas un jeton JWT valide. Veuillez réessayer.
it: Impossibile decodificare il DSS, il codice QR non contiene un token JWT valido. Si prega di riprovare.
ru: Невозможно декодировать DSS, QR-код не содержит действительный токен JWT. Попробуйте еще раз.
tr: DSS okunamıyor, QR kodu geçerli bir JWT belirteci içermiyor. Tekrar deneyin.

# invalidPublicKeyContent
source: The selected file does not contain a valid prime256v1 public key.
de: Die hochgeladene Datei enthält keinen öffentlichen Prime256v1-Schlüssel.
es: El archivo cargado no contiene una clave pública prime256v1.
fr: Le fichier chargé ne contient pas une clé publique prime256v1.
it: Il file caricato non contiene una chiave pubblica prime256v1.
ru: Загруженный файл не содержит открытого ключа prime256v1.
tr: Yüklenen dosya prime256v1 ortak anahtarı içermiyor.

source: About the app
de: Über diese App
es: Acerca de la aplicación
fr: À propos
it: Informazioni sull'app
ru: О
tr: Hakkında

source: Signed by
de: Unterzeichnet von
es: Firmada por
fr: Signée par
it: Firmata da
ru: Подписано
tr: İmzalayan

source: Reference
de: Rechnungsnummer
es: Referencia
fr: Référence
it: Riferimento
ru: Ссылка
tr: Referans
